Autodesk.Navisworks.Api.SavedItemChangedAction
Describes the action that caused a changed event for a Autodesk.Navisworks.Api.SavedItemCollection-based
Autodesk.Navisworks.Api.Document part.

Autodesk.Navisworks.Api.SavedItemChangedAction.Add
An item was added or inserted

Autodesk.Navisworks.Api.SavedItemChangedAction.Remove
An item was removed

Autodesk.Navisworks.Api.SavedItemChangedAction.Replace
An item was replaced

Autodesk.Navisworks.Api.SavedItemChangedAction.Move
An item was moved within the SavedItem hierarchy

Autodesk.Navisworks.Api.SavedItemChangedAction.Edit
An item was edited within the SavedItem hierarchy

Autodesk.Navisworks.Api.SavedItemChangedAction.Reset
The contents of the Document part have changed dramatically